Repository: vdhamer/Photo-Club-Hub
Catalog: Localization/PhotoClubHub.Readme.xcstrings
Source language: en
Languages: nl

# §1.1
source: _Photo Club Hub_ displays selected photos made by members of photo clubs in a consistent, accessible manner, while minimizing distractions.
nl: De _Fotoclub Hub_ app toont geselecteerde foto’s van leden van fotoclubleden.

# §1.2
source: This consistency eliminates the need to manually find each club’s website and discover how to navigate its photo galleries. The app doesn’t replace club-, photographer-, or social media sites. Instead, it supports clubs and their members who try to reach out to other clubs, to other photographers, and to a general audience.
nl: De app is ondermeer te gebruiken als een permanente, centrale, online expositie. Door de foto's op een consistente manier te presenteren, hoeft de gebruiker de websites van clubs niet handmatig op te zoeken. Of per website uit te zoeken waar de foto’s staan of hoe ze te doorlopen.

# §1.3
source: The app aims to strengthen ties between photography clubs and make their members’ photos easily accessible.
nl: De _Fotoclub Hub_ app probeert _niet_ om de websites van clubs te vervangen: de app dient vooral om banden tussen fotoclubs te versterken en om foto's gemaakt door de clubleden makkelijk toegankelijk te maken.

# §1.4
source: The app’s name, _Photo Club Hub_, emphasizes the app’s mission to strengthen connections between photo clubs.
nl: Het woord _Hub_ (middelpunt, trefpunt) in de naam van de app benadrukt dat het fotoclubs ondersteunt en verbindt.

# §1.5
source: Supporting dozens or even hundreds of clubs necessitates that each club manages its own data, including providing images and maintaining lists of club members. Notably, no software expertise is required to add a club to _Photo Club Hub_.
nl: Het ondersteunen van tientallen of zelfs honderden clubs vereist dat de clubs _zelf_ hun gegevens beheren. Het gaat hier om het aanleveren van een lijsten met clubleden en links naar portfolio foto’s. Momenteel gaat dit door het aanleveren van gestandaardiseerd formulier-achtig bestanden. Hiervoor is geen specifieke softwarekennis nodig. Hier komen we verderop in meer detail op terug.

# §1.6
source: Interested in supporting your club? Contact us via [GitHub](https://github.com/vdhamer/Photo-Club-Hub), [Facebook](https://www.facebook.com/vdhamer), or [LinkedIn](https://www.linkedin.com/in/vdhamer/). Providing and maintaining club data in a standardized way is all that’s required. The app’s [GitHub site](https://github.com/vdhamer/Photo-Club-Hub) explains this approach in detail. We’re here to help with any questions.
nl: Neem voor vragen overigens gerust contact op via [Facebook](https://www.facebook.com/vdhamer), [LinkedIn](https://www.linkedin.com/in/vdhamer/) of [GitHub](https://github.com/vdhamer/Photo-Club-Hub).

# §2.1
source: Photo clubs play a key role in the app. The central _Portfolios_ screen shows a list of photo clubs.
nl: Fotoclubs en hun leden spelen, zoals gezegd, een centrale rol in deze app.

# §2.2
source: Each photo club contains a series of member __portfolios__ that hold the actual images. Each portfolio covers the photographer's photos that are associated with that photo club.
nl: De app toon direct na opstarten een lijst van _clubs_ met hun _leden_. Elk clublid heeft een (optionele) link naar diens _portfolio_: een verzameling zorgvuldig geselecteerde _foto’s_ die het werk van dat clublid vertegenwoordigen.

# §2.3
source: A photographer may have multiple portfolios in the app if case the photographer is (or was) associated with more than one photo club.
nl: Een portfolio vertegenwoordigt dus het werk van één fotograaf binnen één club. Fotografen die gelijktijdig lid zijn van meerdere fotoclubs hebben in de app ook meerdere portfolio’s. Dit kan ook voorkomen als fotografen na verloop van tijd overgestapen van één club naar een andere.

# §2.4
source: Just like a painter, a photographer’s style often changes over the years. Each portfolio should preferably show the images in chronological order, with the latest work first.
nl: Net als bij een schilder, kan een fotograaf na verloop van tijd van onderwerp of stijl veranderen. Daarom zijn portfolio’s bij voorkeur gesorteerd met het recentste werk vooraan.

# §2.5
source: We try to show the portfolios with minimal distraction, just like an exposition at a museum or gallery. Web sites tend to be less suitable for this, because they are cluttered by browser controls (e.g., an address bar or tabs), and generally contain various additional types of information (e.g., club news or schedules).
nl: Net als bij een expositie is het belangrijk om een portfolio _zonder afleiding_ te kunnen bekijken. Webpagina's zijn hier vaak iets te druk voor vanwege allerlei bedieningselementen, maar ook omdat ze vaak meerdere doelen tegelijk dienen (zoals het tonen van aankondigingen, contactpersonen, en de agenda met bijeenkomsten).

# §3.01.a
source: __Searching__
nl: __Zoekfunctie__

# §3.01.b
source: Entering part of person’s name in the Search bar (on the _Portfolios_ and _Who’s Who_ screens) will find people with that name. The _Organizations_ screen simultaneously searches for matches in the club/museum name and in its specified location (“town”).
nl: In het _Portfolio's_ scherm kan men zowel op de naam van de fotograaf als op een expertisegebied gebied zoeken. In het _Clubs_ en _Musea_ scherm kan men op de clubnaam of op gemeente zoeken.

# §3.01.c
source: The positioning of the Search bar is different on iPads (top of screen), newer iPhones (bottom of screen) and older iPhones (at the top of the list).
nl: De locatie van het zoekveld hangt af van de schermgrootte van het apparaat en de versie van iOS.

# §3.02.b
source: Photographers can choose to display one or two genres (e.g. “Street”) for which they are relatively well-known. More details [here](https://github.com/vdhamer/Photo-Club-Hub/blob/main/Photo$20Club%20Hub/Documentation/Level2_expertise_EN.md).
nl: Fotografen kunnen één of twee specialisaties vermelden waar ze om bekend staan. Voorbeeld: portretfotografie en zwart-wit fotografie. Meer details hierover [via deze link](https://github.com/vdhamer/Photo-Club-Hub/blob/main/Photo%20Club%20Hub/Documentation/Level2_expertise_NL.md).

# §3.02.c
source: We manage a central list of supported Expertise tags from which a photographer can choose. Standardizing these tags allows you to use the app to find photographers with a notable area of expertise (e.g. “Macro” or “Theatre” photography).
nl: Er is een centrale lijst met ondersteunde expertise tags. Door op het Portfolio scherm te zoeken naar “Portret” of bijvoorbeeld “por” kan je fotografen vinden die in portretfotografie gespecialiseerd zijn.

# §3.03.a
source: __Languages__
nl: __Tweetalig__

# §3.03.b
source: _Photo Club Hub_ automatically selects its language based on your device’s language settings. It currently supports English and Dutch. You can change language using _Settings > Photo Club Hub > Language_. Alternatively you can change your device’s preference across all apps using _Settings > General > Language & Region > Preferred Language Order_.
nl: De app ondersteunt zowel Nederlands (_Fotoclub Hub_) als Engels (_Photo Club Hub_). De app kiest de taal op basis van de taal die ingesteld is op het apparaat. Men kan ook de taalinstelling voor alleen deze app aanpassen onder _Instellingen → Fotoclub Hub → Voorkeurstaal_.

# §3.04.a
source: __3D maps__
nl: __3D kaarten__

# §3.04.b
source: If you zoom in far enough on any map, a button appears that allows you to view the area in three dimensions. In 3D mode you can rotate the map.
nl: Wanneer men ver genoeg inzoomt op een landkaart, verschijnt er een knop waarmee je de kaart in 3D kan weergeven. Inzoomen vereist dat het slotje bij de kaart open is. Probeer het zelf uit, b.v. door te zoeken op New York met zijn wolkenkrabbers.

# §3.05.a
source: __Photographer portraits__
nl: __Hoe ziet de fotograaf eruit?__

# §3.05.b
source: The image next to a photographer’s name on the Members screen and the Photographers screen can be toggled between two different images, if both are provided. One is what the photographer looks like (“photographerImage”); the other is what the photographer’s work looks like (“featuredImage”). You can set a preference in the Preferences screen. It is really a “preference” in the sense that the app will try to show the image you chose, but will switch to the alternative if the preferred image is not available.
nl: Op de Leden en Fotografen schermen kan je instellen of je het gezichten van fotografen in de “thumbnail” wilt zien. Het alternatief is een foto gemaakt door die fotograaf. Een gebruiker kan zijn voorkeur aangeven onder Instellingen. Indien gezicht (_photographerImage_) gekozen is, wordt het gezicht getoond als dat plaatje voor de app beschikbaar is. Anders toont de app een foto (_featuredImage_) uit de portfolio van de fotograaf.

# §3.05.c
source: When the feature is fully implemented, you can also toggle an individual image by tapping on it. This allows you to switch back and forth quickly.
nl: Je kunt ook tijdelijk overschakelen tussen _photographerImage_ en _featuredImage_ door een getoonde plaatje aan te raken. Dan schakelt het aangeraakte plaatje van de ene soort naar de andere soort afbeelding. Als er geen _photographerImage_ beschikbaar is, dan gebeurt er bij aanraken niets.

# §3.06.a
source: __Adding photo clubs__
nl: __Toevoegen van clubs__

# §3.06.b %lld
source: The app currently contains a list of %lld photo clubs. Those clubs are currently all in one part of the Netherlands. The app is however designed to support clubs anywhere in the world and the list of clubs can be extended by the users.
nl: Momenteel kent de app %lld fotoclubs, vooral in regio Brabant Oost. Velen hiervan zijn aangesloten by de Koninklijke Fotobond. De app is overigens ook geschikt voor clubs in het buitenland.

# §3.06.c
source: For a club to be included, the app needs basic information like the club’s name and location (Level 1), a list of its members (Level 2) and links to image portfolios (Level 3). More details on extending the various lists are provided below and on GitHub.
nl: Om een club te ondersteunen, heeft de app informatie nodig over de naam en locatie van de club (“_Niveau 1_” gegevens), de een lijst met de clubleden (“_Niveau 2_” gegevens) en de portfolio’s met foto’s (“_Niveau 3_”). We komen later op deze niveaus terug.

# §3.06.d
source: The initial list of 30+ photo museums can be similarly extended.
nl: Clubs, leden en foto’s toevoegen kan in principe _zonder_ aanpassing van de app software. Dit gaat via online bestanden die de app ophaalt en weergeeft.

# §3.07.a
source: __Photo museums__
nl: __Fotomusea__

# §3.07.b
source: The maps can show various photo museums throughout the world. Museums and clubs are depicted differently on the map.
nl: De landkaarten tonen ook een aantal fotomusea en galerijen die gespecialiseerd zijn in fotografie. De app dekt in principe alle fotomusea in Nederland af. De app kent ook bekende fotomusea in het buitenland (b.v. Antwerpen, Londen, New York, Tokyo). Om ze te zien moet het slot icoon bij de kaart open zijn zodat men zoomen en vegen.

# §3.07.c
source: Adding a photo museum works the same way as adding a photo club - except that a museum doesn’t have members or member portfolios.
nl: Het toevoegen van een fotomuseum werkt net als het toevoegen van een __Niveau 1__ fotoclub. Omdat fotomusea geen leden hebben die foto’s aanmaken zijn __Niveau 2__ en __3__ niet van toepassing.

# §3.08.a
source: __Smart scrolling__
nl: __Slim Scrollen__

# §3.08.b
source: The _Organizations_ screen and the _Who’s Who_ screen feature _smart scrolling_, as introduced in iOS 17. This tries to prevent an item in a list from being partially visible. The _Portfolios_ screen does not currently support smart scrolling for technical reasons.
nl: Het _Organisaties_ scherm and het _Fotografen_ scherm ondersteunen zogenaamde __smart scrolling__. Dit verkleint de kans dat de app een halve foto of halve landkaart laat zien.

# §3.09.b
source: This app is complimentary to your club’s web site. Because web sites serve more purposes than just presenting photos, _Photo Club Hub_ includes clickable links that lead to club- and photographer web sites.
nl: Omdat de websites van fotoclubs allerlei extra informatie bevatten, kan de gebruiker vanuit de app rechtstreeks naar een club website springen. De app ondersteunt ook links naar websites van clubleden die fotografie-gerelateerd zijn.

# §3.10.a
source: __The opening image__
nl: __Het openingsbeeld__

# §3.10.b
source: When the app opens, it shows an image (“Prelude”) corresponding to the app’s icon. If you tap somewhere __inside__ the image, it zooms out to show the full image representing how digital cameras see color. You can select one of the available background images by swiping to the right or left. The latter feature requires iOS 26 or higher.
nl: Na het opstarten van de app verschijnt er een beeld met een versie van het app logo. Men kan in- en uitzoomen door op het centrale beeld te klikken. Op recente versies van iOS kan men uit enkele beschikbare beelden kiezen via swipen.

# §3.10.c
source: This involves a [Bayer color filter array](https://en.wikipedia.org/wiki/Bayer_filter) that adds a color filter on top of each sensor cell. This filter array is shown superimposed on a colorful photo.
nl: Uitgezoomd blijkt het beeld een foto te zijn voorzien van een maskerlaag met kleurenfilters. Dit geeft aan hoe digitale camera's kleur zien (de chip is zonder deze kleurenfilters volledig kleurenblind). Technisch heet dit een [Bayer kleurenfilter](https://nl.wikipedia.org/wiki/Bayerfilter). Per lichtgevoelige cel van de sensor worden bepaalde kleuren hiervoor selectief doorgelaten. Een 24 megapixel camera heeft bijvoorbeeld een raster van 4000 x 6000 microscopisch kleine kleurfiltertjes.

# §3.10.d
source: Tapping __inside__ the image allows you to zoom in or out to your heart's content. Tapping __outside__ the image area ends the animation. A single tap __outside__ the image allows you to skip the animation.
nl: Er is een knop rechtsonder waarmee men de _animatie afbreekt_. Het aanraken van iedere andere plek buiten het centrale beeld breekt ook de animatie af.

# §3.10.e
source: The computations for this animation incidentally run on your device’s GPU cores. This is only scratching the surface of what these cores can do.
nl: De getoonde animatie wordt uitgerekend op de beschikbare [GPU](https://nl.wikipedia.org/wiki/Graphics_processing_unit) rekenkernen van het apparaat.

# §3.11.a
source: __Former Members__
nl: __Voormalige leden__

# §3.11.b
source: By default, former club members and their work are not shown, but this can be enabled on the _Preferences_ screen.
nl: De app kan ook voormalig clubleden tonen. Ex-leden worden standaard niet getoond, maar kunnen onder _Instellingen_ zichtbaar gemaakt worden.

# §3.11.c
source: An easy way to get recent ex-member data in the app is to simply not remove their portfolios when they leave. You should then change their status to ex-member in the membership ("Level 2") list.
nl: De makkelijkste manier om gegevens van recente ex-leden binnen de app te krijgen is om ze gewoon te laten staan op het moment dat een lid vertrekt: in de ledenlijst (_Niveau 2_) kan men aangegeven dat iemand een voormalig lid is. Een club kan ervoor kiezen om ex-leden en hun werk niet te tonen. De app laat het onderscheid tussen leden en ex-leden duidelijk zien.

# §3.12.a
source: __Automatic Slide Shows__
nl: __Automatische afspelen__

# §3.12.b
source: Some portfolios have an automatic slide show option. This is controlled by one of the buttons that appear when you tap on an image (this tapping is only needed on an iPhone).
nl: Portfolio's kunnen automatisch afgespeeld worden via een driehoekige afspeelknop. Soms moet je eerst de foto aanraken om de knop te zien.

# §3.12.c
source: This option is available on portfolios that were generated using the _Juicebox_ plug-in for _Lightroom Classic_ (see the portfolios of Fotogroep de Gender).
nl: Deze knop is aanwezig bij portfolio's die gegenereerd zijn vanuit de _Juicebox Pro_ plug-in voor _Lightroom Classic_. Zie bijvoorbeeld de portfolio's van _Fotogroep de Gender_ (Eindhoven).

# §3.13.a
source: Maps and clubs within the __Fotobond__
nl: Benadrukken van Fotobond clubs

# §4.1
source: _Photo Club Hub_ generally requires the latest version of iOS. This allows us to keep the app technically up to date. The latest app version can thus run on devices released in the last 6 or 7 years.
nl: _Fotoclub Hub_ vereist minimaal iOS 17. In de praktijk betekent dit dat iPhone en iPads vanaf 2018 ondersteund worden. Bij iOS versies vanaf 26.0 is de app aangepast aan de nieuwe “Liquid Glass” stijl van Apple.

# §4.2
source: The app is optimized for iOS and iPadOS. It can also run unoptimized on a Mac or Vision Pro.
nl: Om praktische redenen is de app geoptimaliseerd voor __iPhone__ en __iPad__. Op verzoek kan de app ook op de Vision Pro “bril” draaien.

# §4.3
source: Although there is presently no native support for __Android__ or other non-Apple phone platforms, we made a companion app that automatically generates website pages from the same online lists that the app uses. This helps keep club web sites up to date, and allows viewing of clubs, members, and images in a web browsers on a wide range of platforms (including Android, Windows, MacOS and Linux).
nl: Ofschoon er momenteel geen versie van deze app bestaat voor Android of andere niet-Apple telefoons, is er wel een [zuster app](https://github.com/vdhamer/Photo-Club-Hub-HTML) die webpagina’s aanmaakt aan de hand van exact dezelfde gegevens die deze app ook inleest. Dit helpt om club websites bijgewerkt te houden, maar maakt het ook mogelijk om ledenlijsten, portfolio's en expertises in een web browser te bekijken op allerlei mobiele apparaten (_Android_), op laptops en op grote schermen (_Windows_ en _MacOS_).

# §4.4
source: These developments really depend on the help of volunteers from the clubs and the software community. If you’re interested in helping out, check out the section below.
nl: Omdat de code van de app en zijn bestandsformaten openbaar zijn (via [Github](https://github.com/vdhamer)) kunnen er in principe meer zuster apps beschikbaar komen vanuit de software gemeenschap. De _Photo Club Hub HTML_ app voor websites is hier een eerste voorbeeld van. Zo zou men aanvullende software kunnen schrijven om invoer van clubinformatie te vergemakkelijken.

# §5.1
source: The app needs information in order to cover your local photo club(s). This involves three so-called __Levels__. A club can stay at any level for a while before proceeding to a next level. See the app’s [README](https://github.com/vdhamer/Photo-Club-Hub/blob/main/.github/README.md) file on GitHub for more details.
nl: Om zelf een __fotoclub toe te voegen__ zijn bepaalde gegevens nodig. Dit gaat in __3 Niveaus__ die men kan zien als etages in een trappenhuis: een club kan een tijd op een Niveau verblijven om pas later naar het volgende, hogere Niveau te gaan. Op GitHub staat een uitgebreide engelstalige [README](https://github.com/vdhamer/Photo-Club-Hub/blob/main/.github/README.md) met details hierover.

# §5.2
source: __Level 1__ requires providing the club’s name, location and a few optional links. Once it is on Level 1, the club is listed on the _Organizations_ screen and shown on maps. If you send us the Level 1 information, we will add it to the app’s online list of clubs. The technically inclined can best submit that information (and any future updates) in the form a [GitHub “pull request”](https://www.youtube.com/watch?v=BCQHnlnPusY&list=PLRqwX-V7Uu6ZF9C0YMKuns9sLDzK6zoiV): this pretty much automates the integration process and reduces the risk of errors.
nl: __Niveau 1__ informatie bevat de naam en locatie van de club. Zodra Niveau 1 gegevens beschikbaar zijn, wordt de club zichtbaar in de clublijst op het _Organisaties_ scherm. Verder wordt de club hier letterlijk “op de kaart gezet”. _Fotoclub de Soos_ (Grave) is een voorbeeld van een club op Niveau 1. Wij kunnen deze gegevens voor een club handmatig aan de centrale clublijst toevoegen als U ons die gegevens stuurt. Wij zien echter liever dat een club (of misschien een _Fotobond_ regio) deze gegevens via een [GitHub “pull request”](https://www.youtube.com/watch?v=BCQHnlnPusY&list=PLRqwX-V7Uu6ZF9C0YMKuns9sLDzK6zoiV&index=2) aanbiedt. GitHub is weliswaar voor fotografen een geheel onbekende wereld, maar dit zorgt dat clubs hun gegevensinvoer en gegevensonderhoud in eigen hand houden. Dit verkleint de kans op vertraging of vergissingen.

# §5.3
source: __Level 2__ requires providing a list of the names of current (and optionally former) club members as a text file with a specific format. This file can be stored anywhere as long as it can be fetched using a web address (URL). For example, you can store it in the _Media_ section of your club’s _Wordpress_ web site. At Level 2, the membership lists show up on the _Portfolios_ screen. _Fotogroep Anders_ (NL) shows what a Level 2 club looks like in the user interface.
nl: __Niveau 2__ bestaat uit de __ledenlijst__ in de vorm van een JSON tekstbestand. Het bestand kan op een willekeurige locatie online gezet worden. De app haalt het bestand op via een webadres. Wij zullen documenteren hoe men de ledenlijst kan aanbieden via een _Wordpress_ club website. _Fotoclub den Dungen_ is een voorbeeld van een club op Niveau 2: de naam en locatie zijn bekend (Niveau 1), het _Portfolio’s_ scherm laat alle clubleden zien (Niveau 2), maar er zijn nog geen online portfolio’s via de app beschikbaar (Niveau 3).

# §5.4
source: Clubs at __Level 3__ also provide links to the online images in member portfolios. _Fotogroep de Gender_ (NL) is an example of a Level 3 club: you can view their portfolios via the _Portfolios_ screen. Because a club with dozens of members may want to show hundreds of images, we have a way to automatically create portfolios from _Lightroom_ collections (step-by-step instructions for this will be made available)
nl: __Niveau 3__ bestaat uit de eigenlijke ledenportfolio’s. Een goed voorbeeld is _Fotogroep de Gender_: de portfolio’s van leden en recente ex-leden zijn via het _Portfolio’s_ scherm te bereiken. Omdat een club met tientallen leden vaak honderden foto’s wil tonen, is het genereren van online portfolio's via een _Lightroom_ plug-in geautomatiseerd. Gedetailleerde instructies hiervoor staan in de uitgebreidere [README](https://github.com/vdhamer/Photo-Club-Hub/blob/main/.github/README.md).

# §5.5
source: Help with onboarding of additional clubs is essential. But there are more ways in which you can help out. Examples of __non-technical help__ include testing, writing a review for Apple’s App Store, creating step-by-step user instructions, and coming up with improvement ideas. Last, and certainly not least, actual _software development_ support will help speed up app enhancements, produce fresh ideas and ensure app continuity. Example contributions include code improvement of all sorts (via [GitHub](https://github.com/vdhamer/Photo-Club-Hub)), hunting down bugs, and contributing to discussions on functionality, implementation and interfaces.
nl: Naast het toevoegen van clubs, kunnen wij allerlei andere hulp goed gebruiken. Voorbeelden van __niet-technische__ hulp zijn: het testen van de app, schrijven van FAQs en instructies, en nieuwe ideeën. De app is _open source_ (via [GitHub](https://github.com/vdhamer/Photo-Club-Hub)) om dergelijke hulp bij de __softwareontwikkeling__ mogelijk te maken. Voorbeelden van technische hulp zijn: app uitbreidingen, bugs oplossen, technisch meedenken, of zelfs aanvullende programma’s (b.v. voor gegevensinvoer).
